# Богданов Алексей Максимович
# Найти целые числа, принадлежащие интервалу [1,3]
a=int(input('Введите целое число \n'))
b=int(input('Введите целое число \n'))
c=int(input('Введите целое число \n'))
print('Числа входящие в интервал [1,3]: ')
if a > 0:
    if a < 4:
        print(a,' ')
if b > 0:
    if b < 4:
        print(b,' ')
if c > 0:
    if c < 4:
        print(c)
